EKlatt/2021-AVR-IDE-GCC-11/avrasm2/inc/m4808def.inc
.equ SYSCFG_REVID = 0x0F01               ; Revision ID
.equ SYSCFG_EXTBRK = 0x0F02              ; External Break
.equ SYSCFG_OCDM = 0x0F18                ; OCD Message Register
.equ SYSCFG_OCDMS = 0x0F19               ; OCD Message Status

;*************************************************************************
;** TCA0 - 16-bit Timer/Counter Type A
;*************************************************************************

.equ TCA0_SINGLE_CTRLA = 0x0A00          ; SINGLE Control A
.equ TCA0_SINGLE_CTRLB = 0x0A01          ; SINGLE Control B
.equ TCA0_SINGLE_CTRLC = 0x0A02          ; SINGLE Control C
.equ TCA0_SINGLE_CTRLD = 0x0A03          ; SINGLE Control D
.equ TCA0_SINGLE_CTRLECLR = 0x0A04       ; SINGLE Control E Clear
.equ TCA0_SINGLE_CTRLESET = 0x0A05       ; SINGLE Control E Set
.equ TCA0_SINGLE_CTRLFCLR = 0x0A06       ; SINGLE Control F Clear
.equ TCA0_SINGLE_CTRLFSET = 0x0A07       ; SINGLE Control F Set
.equ TCA0_SINGLE_EVCTRL = 0x0A09         ; SINGLE Event Control
.equ TCA0_SINGLE_INTCTRL = 0x0A0A        ; SINGLE Interrupt Control
.equ TCA0_SINGLE_INTFLAGS = 0x0A0B       ; SINGLE Interrupt Flags
.equ TCA0_SINGLE_DBGCTRL = 0x0A0E        ; SINGLE Degbug Control
.equ TCA0_SINGLE_TEMP = 0x0A0F           ; SINGLE Temporary data for 16-bit Access
.equ TCA0_SINGLE_CNT = 0x0A20            ; SINGLE Count
.equ TCA0_SINGLE_PER = 0x0A26            ; SINGLE Period
.equ TCA0_SINGLE_CMP0 = 0x0A28           ; SINGLE Compare 0
.equ TCA0_SINGLE_CMP1 = 0x0A2A           ; SINGLE Compare 1
.equ TCA0_SINGLE_CMP2 = 0x0A2C           ; SINGLE Compare 2
.equ TCA0_SINGLE_PERBUF = 0x0A36         ; SINGLE Period Buffer
.equ TCA0_SINGLE_CMP0BUF = 0x0A38        ; SINGLE Compare 0 Buffer
.equ TCA0_SINGLE_CMP1BUF = 0x0A3A        ; SINGLE Compare 1 Buffer
.equ TCA0_SINGLE_CMP2BUF = 0x0A3C        ; SINGLE Compare 2 Buffer
.equ TCA0_SPLIT_CTRLA = 0x0A00           ; SPLIT Control A
.equ TCA0_SPLIT_CTRLB = 0x0A01           ; SPLIT Control B
.equ TCA0_SPLIT_CTRLC = 0x0A02           ; SPLIT Control C
.equ TCA0_SPLIT_CTRLD = 0x0A03           ; SPLIT Control D
.equ TCA0_SPLIT_CTRLECLR = 0x0A04        ; SPLIT Control E Clear
.equ TCA0_SPLIT_CTRLESET = 0x0A05        ; SPLIT Control E Set
.equ TCA0_SPLIT_INTCTRL = 0x0A0A         ; SPLIT Interrupt Control
.equ TCA0_SPLIT_INTFLAGS = 0x0A0B        ; SPLIT Interrupt Flags
.equ TCA0_SPLIT_DBGCTRL = 0x0A0E         ; SPLIT Degbug Control
.equ TCA0_SPLIT_LCNT = 0x0A20            ; SPLIT Low Count
.equ TCA0_SPLIT_HCNT = 0x0A21            ; SPLIT High Count
.equ TCA0_SPLIT_LPER = 0x0A26            ; SPLIT Low Period
.equ TCA0_SPLIT_HPER = 0x0A27            ; SPLIT High Period
.equ TCA0_SPLIT_LCMP0 = 0x0A28           ; SPLIT Low Compare
.equ TCA0_SPLIT_HCMP0 = 0x0A29           ; SPLIT High Compare
.equ TCA0_SPLIT_LCMP1 = 0x0A2A           ; SPLIT Low Compare
.equ TCA0_SPLIT_HCMP1 = 0x0A2B           ; SPLIT High Compare
.equ TCA0_SPLIT_LCMP2 = 0x0A2C           ; SPLIT Low Compare
.equ TCA0_SPLIT_HCMP2 = 0x0A2D           ; SPLIT High Compare

;*************************************************************************
;** TCB0 - 16-bit Timer Type B
;*************************************************************************

.equ TCB0_CTRLA = 0x0A80                 ; Control A
.equ TCB0_CTRLB = 0x0A81                 ; Control Register B
.equ TCB0_EVCTRL = 0x0A84                ; Event Control
.equ TCB0_INTCTRL = 0x0A85               ; Interrupt Control
.equ TCB0_INTFLAGS = 0x0A86              ; Interrupt Flags
.equ TCB0_STATUS = 0x0A87                ; Status
.equ TCB0_DBGCTRL = 0x0A88               ; Debug Control
.equ TCB0_TEMP = 0x0A89                  ; Temporary Value
.equ TCB0_CNT = 0x0A8A                   ; Count
.equ TCB0_CNTL = 0x0A8A                  ; Count low byte
.equ TCB0_CNTH = 0x0A8B                  ; Count hi byte
.equ TCB0_CCMP = 0x0A8C                  ; Compare or Capture
.equ TCB0_CCMPL = 0x0A8C                 ; Compare or Capture low byte
.equ TCB0_CCMPH = 0x0A8D                 ; Compare or Capture hi byte

;*************************************************************************
;** TCB1 - 16-bit Timer Type B
;*************************************************************************

.equ TCB1_CTRLA = 0x0A90                 ; Control A
.equ TCB1_CTRLB = 0x0A91                 ; Control Register B
.equ TCB1_EVCTRL = 0x0A94                ; Event Control
.equ TCB1_INTCTRL = 0x0A95               ; Interrupt Control
.equ TCB1_INTFLAGS = 0x0A96              ; Interrupt Flags
.equ TCB1_STATUS = 0x0A97                ; Status
.equ TCB1_DBGCTRL = 0x0A98               ; Debug Control
.equ TCB1_TEMP = 0x0A99                  ; Temporary Value
.equ TCB1_CNT = 0x0A9A                   ; Count
.equ TCB1_CNTL = 0x0A9A                  ; Count low byte
.equ TCB1_CNTH = 0x0A9B                  ; Count hi byte
.equ TCB1_CCMP = 0x0A9C                  ; Compare or Capture
.equ TCB1_CCMPL = 0x0A9C                 ; Compare or Capture low byte
.equ TCB1_CCMPH = 0x0A9D                 ; Compare or Capture hi byte

;*************************************************************************
;** TCB2 - 16-bit Timer Type B
;*************************************************************************

.equ TCB2_CTRLA = 0x0AA0                 ; Control A
.equ TCB2_CTRLB = 0x0AA1                 ; Control Register B
.equ TCB2_EVCTRL = 0x0AA4                ; Event Control
.equ TCB2_INTCTRL = 0x0AA5               ; Interrupt Control
.equ TCB2_INTFLAGS = 0x0AA6              ; Interrupt Flags
.equ TCB2_STATUS = 0x0AA7                ; Status
.equ TCB2_DBGCTRL = 0x0AA8               ; Debug Control
.equ TCB2_TEMP = 0x0AA9                  ; Temporary Value
.equ TCB2_CNT = 0x0AAA                   ; Count
.equ TCB2_CNTL = 0x0AAA                  ; Count low byte
.equ TCB2_CNTH = 0x0AAB                  ; Count hi byte
.equ TCB2_CCMP = 0x0AAC                  ; Compare or Capture
.equ TCB2_CCMPL = 0x0AAC                 ; Compare or Capture low byte
.equ TCB2_CCMPH = 0x0AAD                 ; Compare or Capture hi byte

;*************************************************************************
;** TWI0 - Two-Wire Interface
;*************************************************************************

.equ TWI0_CTRLA = 0x08A0                 ; Control A
.equ TWI0_DUALCTRL = 0x08A1              ; Dual Control
.equ TWI0_DBGCTRL = 0x08A2               ; Debug Control Register
.equ TWI0_MCTRLA = 0x08A3                ; Master Control A
.equ TWI0_MCTRLB = 0x08A4                ; Master Control B
.equ TWI0_MSTATUS = 0x08A5               ; Master Status
.equ TWI0_MBAUD = 0x08A6                 ; Master Baurd Rate Control
.equ TWI0_MADDR = 0x08A7                 ; Master Address
.equ TWI0_MDATA = 0x08A8                 ; Master Data
.equ TWI0_SCTRLA = 0x08A9                ; Slave Control A
.equ TWI0_SCTRLB = 0x08AA                ; Slave Control B
.equ TWI0_SSTATUS = 0x08AB               ; Slave Status
.equ TWI0_SADDR = 0x08AC                 ; Slave Address
.equ TWI0_SDATA = 0x08AD                 ; Slave Data
.equ TWI0_SADDRMASK = 0x08AE             ; Slave Address Mask

;*************************************************************************
;** USART0 - Universal Synchronous and Asynchronous Receiver and Transmitter
;*************************************************************************

.equ USART0_RXDATAL = 0x0800             ; Receive Data Low Byte
.equ USART0_RXDATAH = 0x0801             ; Receive Data High Byte
.equ USART0_TXDATAL = 0x0802             ; Transmit Data Low Byte
.equ USART0_TXDATAH = 0x0803             ; Transmit Data High Byte
.equ USART0_STATUS = 0x0804              ; Status
.equ USART0_CTRLA = 0x0805               ; Control A
.equ USART0_CTRLB = 0x0806               ; Control B
.equ USART0_CTRLC = 0x0807               ; Control C
.equ USART0_BAUD = 0x0808                ; Baud Rate
.equ USART0_BAUDL = 0x0808               ; Baud Rate low byte
.equ USART0_BAUDH = 0x0809               ; Baud Rate hi byte
.equ USART0_CTRLD = 0x080A               ; Control D
.equ USART0_DBGCTRL = 0x080B             ; Debug Control
.equ USART0_EVCTRL = 0x080C              ; Event Control
.equ USART0_TXPLCTRL = 0x080D            ; IRCOM Transmitter Pulse Length Control
.equ USART0_RXPLCTRL = 0x080E            ; IRCOM Receiver Pulse Length Control

;*************************************************************************
;** USART1 - Universal Synchronous and Asynchronous Receiver and Transmitter
;*************************************************************************

.equ USART1_RXDATAL = 0x0820             ; Receive Data Low Byte
.equ USART1_RXDATAH = 0x0821             ; Receive Data High Byte
.equ USART1_TXDATAL = 0x0822             ; Transmit Data Low Byte
.equ USART1_TXDATAH = 0x0823             ; Transmit Data High Byte
.equ USART1_STATUS = 0x0824              ; Status
.equ USART1_CTRLA = 0x0825               ; Control A
.equ USART1_CTRLB = 0x0826               ; Control B
.equ USART1_CTRLC = 0x0827               ; Control C
.equ USART1_BAUD = 0x0828                ; Baud Rate
.equ USART1_BAUDL = 0x0828               ; Baud Rate low byte
.equ USART1_BAUDH = 0x0829               ; Baud Rate hi byte
.equ USART1_CTRLD = 0x082A               ; Control D
.equ USART1_DBGCTRL = 0x082B             ; Debug Control
.equ USART1_EVCTRL = 0x082C              ; Event Control
.equ USART1_TXPLCTRL = 0x082D            ; IRCOM Transmitter Pulse Length Control
.equ USART1_RXPLCTRL = 0x082E            ; IRCOM Receiver Pulse Length Control

;*************************************************************************
;** USART2 - Universal Synchronous and Asynchronous Receiver and Transmitter
;*************************************************************************

.equ USART2_RXDATAL = 0x0840             ; Receive Data Low Byte
.equ USART2_RXDATAH = 0x0841             ; Receive Data High Byte
.equ USART2_TXDATAL = 0x0842             ; Transmit Data Low Byte
.equ USART2_TXDATAH = 0x0843             ; Transmit Data High Byte
.equ USART2_STATUS = 0x0844              ; Status
.equ USART2_CTRLA = 0x0845               ; Control A
.equ USART2_CTRLB = 0x0846               ; Control B
.equ USART2_CTRLC = 0x0847               ; Control C
.equ USART2_BAUD = 0x0848                ; Baud Rate
.equ USART2_BAUDL = 0x0848               ; Baud Rate low byte
.equ USART2_BAUDH = 0x0849               ; Baud Rate hi byte
.equ USART2_CTRLD = 0x084A               ; Control D
.equ USART2_DBGCTRL = 0x084B             ; Debug Control
.equ USART2_EVCTRL = 0x084C              ; Event Control
.equ USART2_TXPLCTRL = 0x084D            ; IRCOM Transmitter Pulse Length Control
.equ USART2_RXPLCTRL = 0x084E            ; IRCOM Receiver Pulse Length Control

;*************************************************************************
;** USERROW - User Row
;*************************************************************************

.equ USERROW_USERROW0 = 0x1300           ; User Row Byte 0
.equ USERROW_USERROW1 = 0x1301           ; User Row Byte 1
.equ USERROW_USERROW2 = 0x1302           ; User Row Byte 2
.equ USERROW_USERROW3 = 0x1303           ; User Row Byte 3
.equ USERROW_USERROW4 = 0x1304           ; User Row Byte 4
.equ USERROW_USERROW5 = 0x1305           ; User Row Byte 5
.equ USERROW_USERROW6 = 0x1306           ; User Row Byte 6
.equ USERROW_USERROW7 = 0x1307           ; User Row Byte 7
.equ USERROW_USERROW8 = 0x1308           ; User Row Byte 8
.equ USERROW_USERROW9 = 0x1309           ; User Row Byte 9
.equ USERROW_USERROW10 = 0x130A          ; User Row Byte 10
.equ USERROW_USERROW11 = 0x130B          ; User Row Byte 11
.equ USERROW_USERROW12 = 0x130C          ; User Row Byte 12
.equ USERROW_USERROW13 = 0x130D          ; User Row Byte 13
.equ USERROW_USERROW14 = 0x130E          ; User Row Byte 14
.equ USERROW_USERROW15 = 0x130F          ; User Row Byte 15
.equ USERROW_USERROW16 = 0x1310          ; User Row Byte 16
.equ USERROW_USERROW17 = 0x1311          ; User Row Byte 17
.equ USERROW_USERROW18 = 0x1312          ; User Row Byte 18
.equ USERROW_USERROW19 = 0x1313          ; User Row Byte 19
.equ USERROW_USERROW20 = 0x1314          ; User Row Byte 20
.equ USERROW_USERROW21 = 0x1315          ; User Row Byte 21
.equ USERROW_USERROW22 = 0x1316          ; User Row Byte 22
.equ USERROW_USERROW23 = 0x1317          ; User Row Byte 23
.equ USERROW_USERROW24 = 0x1318          ; User Row Byte 24
.equ USERROW_USERROW25 = 0x1319          ; User Row Byte 25
.equ USERROW_USERROW26 = 0x131A          ; User Row Byte 26
.equ USERROW_USERROW27 = 0x131B          ; User Row Byte 27
.equ USERROW_USERROW28 = 0x131C          ; User Row Byte 28
.equ USERROW_USERROW29 = 0x131D          ; User Row Byte 29
.equ USERROW_USERROW30 = 0x131E          ; User Row Byte 30
.equ USERROW_USERROW31 = 0x131F          ; User Row Byte 31
.equ USERROW_USERROW32 = 0x1320          ; User Row Byte 32
.equ USERROW_USERROW33 = 0x1321          ; User Row Byte 33
.equ USERROW_USERROW34 = 0x1322          ; User Row Byte 34
.equ USERROW_USERROW35 = 0x1323          ; User Row Byte 35
.equ USERROW_USERROW36 = 0x1324          ; User Row Byte 36
.equ USERROW_USERROW37 = 0x1325          ; User Row Byte 37
.equ USERROW_USERROW38 = 0x1326          ; User Row Byte 38
.equ USERROW_USERROW39 = 0x1327          ; User Row Byte 39
.equ USERROW_USERROW40 = 0x1328          ; User Row Byte 40
.equ USERROW_USERROW41 = 0x1329          ; User Row Byte 41
.equ USERROW_USERROW42 = 0x132A          ; User Row Byte 42
.equ USERROW_USERROW43 = 0x132B          ; User Row Byte 43
.equ USERROW_USERROW44 = 0x132C          ; User Row Byte 44
.equ USERROW_USERROW45 = 0x132D          ; User Row Byte 45
.equ USERROW_USERROW46 = 0x132E          ; User Row Byte 46
.equ USERROW_USERROW47 = 0x132F          ; User Row Byte 47
.equ USERROW_USERROW48 = 0x1330          ; User Row Byte 48
.equ USERROW_USERROW49 = 0x1331          ; User Row Byte 49
.equ USERROW_USERROW50 = 0x1332          ; User Row Byte 50
.equ USERROW_USERROW51 = 0x1333          ; User Row Byte 51
.equ USERROW_USERROW52 = 0x1334          ; User Row Byte 52
.equ USERROW_USERROW53 = 0x1335          ; User Row Byte 53
.equ USERROW_USERROW54 = 0x1336          ; User Row Byte 54
.equ USERROW_USERROW55 = 0x1337          ; User Row Byte 55
.equ USERROW_USERROW56 = 0x1338          ; User Row Byte 56
.equ USERROW_USERROW57 = 0x1339          ; User Row Byte 57
.equ USERROW_USERROW58 = 0x133A          ; User Row Byte 58
.equ USERROW_USERROW59 = 0x133B          ; User Row Byte 59
.equ USERROW_USERROW60 = 0x133C          ; User Row Byte 60
.equ USERROW_USERROW61 = 0x133D          ; User Row Byte 61
.equ USERROW_USERROW62 = 0x133E          ; User Row Byte 62
.equ USERROW_USERROW63 = 0x133F          ; User Row Byte 63

;*************************************************************************
;** VPORTA - Virtual Ports
;*************************************************************************

.equ VPORTA_DIR = 0x0000                 ; Data Direction
.equ VPORTA_OUT = 0x0001                 ; Output Value
.equ VPORTA_IN = 0x0002                  ; Input Value
.equ VPORTA_INTFLAGS = 0x0003            ; Interrupt Flags

;*************************************************************************
;** VPORTB - Virtual Ports
;*************************************************************************

.equ VPORTB_DIR = 0x0004                 ; Data Direction
.equ VPORTB_OUT = 0x0005                 ; Output Value
.equ VPORTB_IN = 0x0006                  ; Input Value
.equ VPORTB_INTFLAGS = 0x0007            ; Interrupt Flags

;*************************************************************************
;** VPORTC - Virtual Ports
;*************************************************************************

.equ VPORTC_DIR = 0x0008                 ; Data Direction
.equ VPORTC_OUT = 0x0009                 ; Output Value
.equ VPORTC_IN = 0x000A                  ; Input Value
.equ VPORTC_INTFLAGS = 0x000B            ; Interrupt Flags

;*************************************************************************
;** VPORTD - Virtual Ports
;*************************************************************************

.equ VPORTD_DIR = 0x000C                 ; Data Direction
.equ VPORTD_OUT = 0x000D                 ; Output Value
.equ VPORTD_IN = 0x000E                  ; Input Value
.equ VPORTD_INTFLAGS = 0x000F            ; Interrupt Flags

;*************************************************************************
;** VPORTE - Virtual Ports
;*************************************************************************

.equ VPORTE_DIR = 0x0010                 ; Data Direction
.equ VPORTE_OUT = 0x0011                 ; Output Value
.equ VPORTE_IN = 0x0012                  ; Input Value
.equ VPORTE_INTFLAGS = 0x0013            ; Interrupt Flags

;*************************************************************************
;** VPORTF - Virtual Ports
;*************************************************************************

