EKlatt/2021-AVR-IDE-GCC-11/avrasm2/inc/m4808def.inc
; CRCSCAN_CTRLA masks
.equ CRCSCAN_ENABLE_bm = 0x01            ; Enable CRC scan bit mask
.equ CRCSCAN_ENABLE_bp = 0               ; Enable CRC scan bit position
.equ CRCSCAN_NMIEN_bm = 0x02             ; Enable NMI Trigger bit mask
.equ CRCSCAN_NMIEN_bp = 1                ; Enable NMI Trigger bit position
.equ CRCSCAN_RESET_bm = 0x80             ; Reset CRC scan bit mask
.equ CRCSCAN_RESET_bp = 7                ; Reset CRC scan bit position

; CRCSCAN_CTRLB masks
.equ CRCSCAN_SRC_gm = 0x03               ; CRC Source group mask
.equ CRCSCAN_SRC_gp = 0                  ; CRC Source group position
.equ CRCSCAN_SRC0_bm = (1<<0)            ; CRC Source bit 0 mask
.equ CRCSCAN_SRC0_bp = 0                 ; CRC Source bit 0 position
.equ CRCSCAN_SRC1_bm = (1<<1)            ; CRC Source bit 1 mask
.equ CRCSCAN_SRC1_bp = 1                 ; CRC Source bit 1 position

; CRCSCAN_STATUS masks
.equ CRCSCAN_BUSY_bm = 0x01              ; CRC Busy bit mask
.equ CRCSCAN_BUSY_bp = 0                 ; CRC Busy bit position
.equ CRCSCAN_OK_bm = 0x02                ; CRC Ok bit mask
.equ CRCSCAN_OK_bp = 1                   ; CRC Ok bit position

; CRC Source select
.equ CRCSCAN_SRC_FLASH_gc = (0x00<<0)    ; CRC on entire flash
.equ CRCSCAN_SRC_APPLICATION_gc = (0x01<<0) ; CRC on boot and appl section of flash
.equ CRCSCAN_SRC_BOOT_gc = (0x02<<0)     ; CRC on boot section of flash


;*************************************************************************
;** EVSYS - Event System
;*************************************************************************

; EVSYS_CHANNEL0 masks
.equ EVSYS_GENERATOR_gm = 0xFF           ; Generator selector group mask
.equ EVSYS_GENERATOR_gp = 0              ; Generator selector group position
.equ EVSYS_GENERATOR0_bm = (1<<0)        ; Generator selector bit 0 mask
.equ EVSYS_GENERATOR0_bp = 0             ; Generator selector bit 0 position
.equ EVSYS_GENERATOR1_bm = (1<<1)        ; Generator selector bit 1 mask
.equ EVSYS_GENERATOR1_bp = 1             ; Generator selector bit 1 position
.equ EVSYS_GENERATOR2_bm = (1<<2)        ; Generator selector bit 2 mask
.equ EVSYS_GENERATOR2_bp = 2             ; Generator selector bit 2 position
.equ EVSYS_GENERATOR3_bm = (1<<3)        ; Generator selector bit 3 mask
.equ EVSYS_GENERATOR3_bp = 3             ; Generator selector bit 3 position
.equ EVSYS_GENERATOR4_bm = (1<<4)        ; Generator selector bit 4 mask
.equ EVSYS_GENERATOR4_bp = 4             ; Generator selector bit 4 position
.equ EVSYS_GENERATOR5_bm = (1<<5)        ; Generator selector bit 5 mask
.equ EVSYS_GENERATOR5_bp = 5             ; Generator selector bit 5 position
.equ EVSYS_GENERATOR6_bm = (1<<6)        ; Generator selector bit 6 mask
.equ EVSYS_GENERATOR6_bp = 6             ; Generator selector bit 6 position
.equ EVSYS_GENERATOR7_bm = (1<<7)        ; Generator selector bit 7 mask
.equ EVSYS_GENERATOR7_bp = 7             ; Generator selector bit 7 position

; EVSYS_CHANNEL1 masks
; Masks for EVSYS_GENERATOR already defined

; EVSYS_CHANNEL2 masks
; Masks for EVSYS_GENERATOR already defined

; EVSYS_CHANNEL3 masks
; Masks for EVSYS_GENERATOR already defined

; EVSYS_CHANNEL4 masks
; Masks for EVSYS_GENERATOR already defined

; EVSYS_CHANNEL5 masks
; Masks for EVSYS_GENERATOR already defined

; EVSYS_STROBE masks
.equ EVSYS_STROBE0_gm = 0xFF             ; Software event on channels group mask
.equ EVSYS_STROBE0_gp = 0                ; Software event on channels group position
.equ EVSYS_STROBE00_bm = (1<<0)          ; Software event on channels bit 0 mask
.equ EVSYS_STROBE00_bp = 0               ; Software event on channels bit 0 position
.equ EVSYS_STROBE01_bm = (1<<1)          ; Software event on channels bit 1 mask
.equ EVSYS_STROBE01_bp = 1               ; Software event on channels bit 1 position
.equ EVSYS_STROBE02_bm = (1<<2)          ; Software event on channels bit 2 mask
.equ EVSYS_STROBE02_bp = 2               ; Software event on channels bit 2 position
.equ EVSYS_STROBE03_bm = (1<<3)          ; Software event on channels bit 3 mask
.equ EVSYS_STROBE03_bp = 3               ; Software event on channels bit 3 position
.equ EVSYS_STROBE04_bm = (1<<4)          ; Software event on channels bit 4 mask
.equ EVSYS_STROBE04_bp = 4               ; Software event on channels bit 4 position
.equ EVSYS_STROBE05_bm = (1<<5)          ; Software event on channels bit 5 mask
.equ EVSYS_STROBE05_bp = 5               ; Software event on channels bit 5 position
.equ EVSYS_STROBE06_bm = (1<<6)          ; Software event on channels bit 6 mask
.equ EVSYS_STROBE06_bp = 6               ; Software event on channels bit 6 position
.equ EVSYS_STROBE07_bm = (1<<7)          ; Software event on channels bit 7 mask
.equ EVSYS_STROBE07_bp = 7               ; Software event on channels bit 7 position

; EVSYS_USERADC0 masks
.equ EVSYS_CHANNEL_gm = 0xFF             ; Channel selector group mask
.equ EVSYS_CHANNEL_gp = 0                ; Channel selector group position
.equ EVSYS_CHANNEL0_bm = (1<<0)          ; Channel selector bit 0 mask
.equ EVSYS_CHANNEL0_bp = 0               ; Channel selector bit 0 position
.equ EVSYS_CHANNEL1_bm = (1<<1)          ; Channel selector bit 1 mask
.equ EVSYS_CHANNEL1_bp = 1               ; Channel selector bit 1 position
.equ EVSYS_CHANNEL2_bm = (1<<2)          ; Channel selector bit 2 mask
.equ EVSYS_CHANNEL2_bp = 2               ; Channel selector bit 2 position
.equ EVSYS_CHANNEL3_bm = (1<<3)          ; Channel selector bit 3 mask
.equ EVSYS_CHANNEL3_bp = 3               ; Channel selector bit 3 position
.equ EVSYS_CHANNEL4_bm = (1<<4)          ; Channel selector bit 4 mask
.equ EVSYS_CHANNEL4_bp = 4               ; Channel selector bit 4 position
.equ EVSYS_CHANNEL5_bm = (1<<5)          ; Channel selector bit 5 mask
.equ EVSYS_CHANNEL5_bp = 5               ; Channel selector bit 5 position
.equ EVSYS_CHANNEL6_bm = (1<<6)          ; Channel selector bit 6 mask
.equ EVSYS_CHANNEL6_bp = 6               ; Channel selector bit 6 position
.equ EVSYS_CHANNEL7_bm = (1<<7)          ; Channel selector bit 7 mask
.equ EVSYS_CHANNEL7_bp = 7               ; Channel selector bit 7 position

