EKlatt/2021-AVR-IDE-GCC-11/avrasm2/inc/m4808def.inc
; Definitions used by the assembler
#pragma AVRPART MEMORY PROG_FLASH 0xC000
#pragma AVRPART MEMORY EEPROM 0x0100
#pragma AVRPART MEMORY INT_SRAM SIZE 0x1800
#pragma AVRPART MEMORY INT_SRAM START_ADDR 0x2800

; ***** INTERRUPT VECTORS, ABSOLUTE ADDRESSES ****************************

; CRCSCAN interrupt vectors
.equ CRCSCAN_NMI_vect = 0x0002           ; 

; BOD interrupt vectors
.equ BOD_VLM_vect = 0x0004               ; 

; RTC interrupt vectors
.equ RTC_CNT_vect = 0x0006               ; 
.equ RTC_PIT_vect = 0x0008               ; 

; CCL interrupt vectors
.equ CCL_CCL_vect = 0x000A               ; 

; PORTA interrupt vectors
.equ PORTA_PORT_vect = 0x000C            ; 

; TCA0 interrupt vectors
.equ TCA0_LUNF_vect = 0x000E             ; 
.equ TCA0_OVF_vect = 0x000E              ; 
.equ TCA0_HUNF_vect = 0x0010             ; 
.equ TCA0_CMP0_vect = 0x0012             ; 
.equ TCA0_LCMP0_vect = 0x0012            ; 
.equ TCA0_CMP1_vect = 0x0014             ; 
.equ TCA0_LCMP1_vect = 0x0014            ; 
.equ TCA0_CMP2_vect = 0x0016             ; 
.equ TCA0_LCMP2_vect = 0x0016            ; 

; TCB0 interrupt vectors
.equ TCB0_INT_vect = 0x0018              ; 

; TCB1 interrupt vectors
.equ TCB1_INT_vect = 0x001A              ; 

; TWI0 interrupt vectors
.equ TWI0_TWIS_vect = 0x001C             ; 
.equ TWI0_TWIM_vect = 0x001E             ; 

; SPI0 interrupt vectors
.equ SPI0_INT_vect = 0x0020              ; 

; USART0 interrupt vectors
.equ USART0_RXC_vect = 0x0022            ; 
.equ USART0_DRE_vect = 0x0024            ; 
.equ USART0_TXC_vect = 0x0026            ; 

; PORTD interrupt vectors
.equ PORTD_PORT_vect = 0x0028            ; 

; AC0 interrupt vectors
.equ AC0_AC_vect = 0x002A                ; 

; ADC0 interrupt vectors
.equ ADC0_RESRDY_vect = 0x002C           ; 
.equ ADC0_WCOMP_vect = 0x002E            ; 

; PORTC interrupt vectors
.equ PORTC_PORT_vect = 0x0030            ; 

; TCB2 interrupt vectors
.equ TCB2_INT_vect = 0x0032              ; 

; USART1 interrupt vectors
.equ USART1_RXC_vect = 0x0034            ; 
.equ USART1_DRE_vect = 0x0036            ; 
.equ USART1_TXC_vect = 0x0038            ; 

; PORTF interrupt vectors
.equ PORTF_PORT_vect = 0x003A            ; 

; NVMCTRL interrupt vectors
.equ NVMCTRL_EE_vect = 0x003C            ; 

; USART2 interrupt vectors
.equ USART2_RXC_vect = 0x003E            ; 
.equ USART2_DRE_vect = 0x0040            ; 
.equ USART2_TXC_vect = 0x0042            ; 

; PORTB interrupt vectors
.equ PORTB_PORT_vect = 0x0044            ; 

; PORTE interrupt vectors
.equ PORTE_PORT_vect = 0x0046            ; 



; ***** INTERRUPT VECTORS, MODULE BASES **********************************

.equ CRCSCAN_vbase = 0x0002
.equ BOD_vbase = 0x0004
.equ RTC_vbase = 0x0006
.equ CCL_vbase = 0x000A
.equ PORTA_vbase = 0x000C
.equ TCA0_vbase = 0x000E
.equ TCB0_vbase = 0x0018
.equ TCB1_vbase = 0x001A
.equ TWI0_vbase = 0x001C
.equ SPI0_vbase = 0x0020
.equ USART0_vbase = 0x0022
.equ PORTD_vbase = 0x0028
.equ AC0_vbase = 0x002A
.equ ADC0_vbase = 0x002C
.equ PORTC_vbase = 0x0030
.equ TCB2_vbase = 0x0032
.equ USART1_vbase = 0x0034
.equ PORTF_vbase = 0x003A
.equ NVMCTRL_vbase = 0x003C
.equ USART2_vbase = 0x003E
.equ PORTB_vbase = 0x0044
.equ PORTE_vbase = 0x0046


; ***** INTERRUPT VECTORS, VECTOR OFFSETS ********************************

; CRCSCAN interrupt vector offsets

.equ CRCSCAN_NMI_voffset = 0

; BOD interrupt vector offsets

.equ BOD_VLM_voffset = 0

; RTC interrupt vector offsets

.equ RTC_CNT_voffset = 0
.equ RTC_PIT_voffset = 2

; CCL interrupt vector offsets

.equ CCL_CCL_voffset = 0

; PORTA interrupt vector offsets

.equ PORTA_PORT_voffset = 0

; TCA0 interrupt vector offsets

.equ TCA0_LUNF_voffset = 0
.equ TCA0_OVF_voffset = 0
.equ TCA0_HUNF_voffset = 2
.equ TCA0_CMP0_voffset = 4
.equ TCA0_LCMP0_voffset = 4
.equ TCA0_CMP1_voffset = 6
.equ TCA0_LCMP1_voffset = 6
.equ TCA0_CMP2_voffset = 8
.equ TCA0_LCMP2_voffset = 8

; TCB0 interrupt vector offsets

.equ TCB0_INT_voffset = 0

; TCB1 interrupt vector offsets

.equ TCB1_INT_voffset = 0

; TWI0 interrupt vector offsets

.equ TWI0_TWIS_voffset = 0
.equ TWI0_TWIM_voffset = 2

; SPI0 interrupt vector offsets

.equ SPI0_INT_voffset = 0

; USART0 interrupt vector offsets

.equ USART0_RXC_voffset = 0
.equ USART0_DRE_voffset = 2
.equ USART0_TXC_voffset = 4

; PORTD interrupt vector offsets

.equ PORTD_PORT_voffset = 0

; AC0 interrupt vector offsets

.equ AC0_AC_voffset = 0

; ADC0 interrupt vector offsets

.equ ADC0_RESRDY_voffset = 0
.equ ADC0_WCOMP_voffset = 2

; PORTC interrupt vector offsets

.equ PORTC_PORT_voffset = 0

; TCB2 interrupt vector offsets

.equ TCB2_INT_voffset = 0

; USART1 interrupt vector offsets

.equ USART1_RXC_voffset = 0
.equ USART1_DRE_voffset = 2
.equ USART1_TXC_voffset = 4

; PORTF interrupt vector offsets

.equ PORTF_PORT_voffset = 0

; NVMCTRL interrupt vector offsets

.equ NVMCTRL_EE_voffset = 0

; USART2 interrupt vector offsets

.equ USART2_RXC_voffset = 0
.equ USART2_DRE_voffset = 2
.equ USART2_TXC_voffset = 4

; PORTB interrupt vector offsets

.equ PORTB_PORT_voffset = 0

; PORTE interrupt vector offsets

.equ PORTE_PORT_voffset = 0



.equ INT_VECTORS_SIZE = 72 ; size in words


#endif /* _M4808DEF_INC_ */

; ***** END OF FILE ******************************************************



